<template>
    <div class="article">
        <h2>设计原则</h2>
        <p>king Dot 使用基本设计要素统一风格，专注于用户体验和交互，建立稳定、灵活的设计，为使用者解决设计问题。</p>
        <h3>清晰</h3>
        <ul class="design-list">
            <li>设计表达：对设计的表达明确清晰，让用户快速理解进行使用。</li>
            <li>颜色对比：突出颜色视觉效果，在视觉交互上面更具有可读性。比如成功消息会使用淡绿色表示，更符合用户的逻辑。</li>
        </ul>
        <h3>效率</h3>
        <ul class="design-list">
            <li>流程简化：简洁直观的流程的帮助用户提高效率，就有更多时间做有价值的事。</li>
            <li>智能帮助：帮助用户更智能、更高效的工作。</li>
        </ul>
        <h3>一致</h3>
        <ul class="design-list">
            <li>行为一致：在与人机交互、按钮反馈、功能行为等充分为用户把关，体验和理解用户的行为习惯，减少用户学习成本。</li>
            <li>界面一致：产品中对功能、元素、结构保持一致的设计。比如按钮、边距、颜色等会重复出现，加强一致性。</li>
            <li>生活一致：设计中最重要的视觉，对布局，色彩，图标，应该保持和自然生活中一致，降低用户认证的成本。创造出更贴近生活的产品体验。</li>
        </ul>
        <h3>交互</h3>
        <ul class="design-list">
            <li>视觉交互：颜色是非常主观的一样事物，某种颜色表现的含义不一样，可以选择自己喜欢的风格主题。</li>
            <li>页面反馈：在操作某个功能时，观察页面的变化。及时反馈当前功能状态。</li>
        </ul>
    </div>
</template>
<style scoped lang="stylus" type="text/stylus">
    .article
        padding 0 200px 40px 40px
        flex 1
        overflow auto
        p
            line-height 20px
</style>
